// Реализация попап на обеих страницах: +12

// console.log(`
//   [x] попап появляется при нажатии на любое место карточки с описанием конкретного животного: +2
//   [x] окно попапа (не считая кнопку с крестиком) центрировано по всем осям, размеры элементов попапа и их расположение совпадают с макетом: +2
//   [x] часть страницы вне попапа затемняется: +2
//   [x] при открытии попапа вертикальный скролл страницы становится неактивным, при закрытии - снова активным: +2
//   [x] при нажатии на область вокруг попапа или на кнопку с крестиком попап закрывается (оба варианта должны быть реализованы), при этом при нажатии на сам попап ничего не происходит: +2
//   [x] кнопка с крестиком интерактивная: +2
// `)
